darren1713/elua/src/platform/stm32/platform-omniext.c
// Platform-dependent functions

#include "platform.h"
#include "platform-omniext.h"
#include "type.h"
#include "devman.h"
#include "genstd.h"
#include <reent.h>
#include <errno.h>
#include <string.h>
#include <ctype.h>
#include <stdio.h>
#include "uip_arp.h"
#include "elua_uip.h"
#include "elua_adc.h"
#include "uip-conf.h"
#include "platform_conf.h"
#include "diskio.h"
#include "common.h"
#include "buf.h"
#include "utils.h"
#include "lua.h"
#include "lauxlib.h"
#include "lrotable.h"
#include "bitbanding.h"
#include "integer.h"

// Platform specific includes
#include "stm32f10x.h"
#include "stm32f10x_pwr.h"
#include "stm32f10x_rtc.h"

#define DEBUG
#include "trace.h"

// Clock data
// IMPORTANT: if you change these, make sure to modify RCC_Configuration() too!
#define HCLK        ( (HSE_Value/2) * 9 )
#define PCLK1_DIV   2
#define PCLK2_DIV   1
const uint32_t SystemCoreClock = HCLK;

// SysTick Config Data
// NOTE: when using virtual timers, SYSTICKHZ and VTMR_FREQ_HZ should have the
// same value, as they're served by the same timer (the systick)
// Max SysTick preload value is 16777215, for STM32F103RET6 @ 72 MHz, lowest acceptable rate would be about 5 Hz
#define SYSTICKHZ               10  
#define SYSTICKMS               (1000 / SYSTICKHZ)

void delay_us(volatile uint16_t msd)
{
    for(;msd;msd--) DELAY_9_CLK;
}

void delay_ms(volatile uint16_t msd)
{
    for(;msd;msd--) DELAY_1_MS;
}

// ****************************************************************************
// Platform initialization

// forward dcls
static void RCC_Configuration(void);
static void RTC_Configuration(void);
static void NVIC_Configuration(void);

static void timers_init();
static void pwms_init();
static void uarts_init();
static void spis_init();
static void pios_init();
static void adcs_init();

int platform_init()
{
  // Set the clocking to run from PLL
  RCC_Configuration();
  
  RTC_Configuration();

  // Setup IRQ's
  NVIC_Configuration();

  // Setup PIO
  pios_init();

  // Setup UARTs
  uarts_init();
  UART_Init_Defaults();
  
  TRACE("Am I running?\n");
  UART_SendChar('T', (ULONG)USART1);
  UART_SendChar('e', (ULONG)USART1);
  UART_SendChar('s', (ULONG)USART1);
  UART_SendChar('t', (ULONG)USART1);
  UART_SendChar('\n', (ULONG)USART1);
  
  // Setup SPIs
  spis_init();
  
  // Setup timers
  timers_init();
  
  // Setup PWMs
  pwms_init();

#ifdef BUILD_ADC
  // Setup ADCs
  adcs_init();
#endif

  // Setup CANs
  //cans_init();
  
  // Enable SysTick
  if ( SysTick_Config( SystemCoreClock / SYSTICKHZ ) )
  { 
    /* Capture error */ 
    while (1);
  }
  
  cmn_platform_init();

  // All done
  return PLATFORM_OK;
}

// ****************************************************************************
// Clocks
// Shared by all STM32 devices.
// TODO: Fix to handle different crystal frequencies and CPU frequencies.

/*******************************************************************************
* Function Name  : RCC_Configuration
* Description    : Configures the different system clocks.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
static void RCC_Configuration(void)
{
  //SystemInit();
  
  // Enable HSI Clock
  RCC_HSICmd(ENABLE);
  
  //Wait till HSI is ready
  while (RCC_GetFlagStatus(RCC_FLAG_HSIRDY) == RESET) {}  
   
  // turn off the external oscillator, the clock security system, and the PLL
  RCC->CR &= ~(RCC_CR_HSEON | RCC_CR_CSSON | RCC_CR_PLLON);
 
  // disable and clear any pending interrupts
  RCC->CIR =
    RCC_CIR_LSIRDYC |
    RCC_CIR_LSERDYC |
    RCC_CIR_HSIRDYC |
    RCC_CIR_HSERDYC |
    RCC_CIR_PLLRDYC |
    RCC_CIR_CSSC;
  
    
  // turn on the external oscillator
  RCC->CR |= RCC_CR_HSEON;
  
  // wait for the HSE to become ready
  while((RCC->CR & RCC_CR_HSERDY) == 0) {};

  // turn on the flash pre-fetch buffer and set its wait state to 2
  FLASH->ACR |= FLASH_ACR_PRFTBE;
  FLASH->ACR  = (FLASH->ACR & ~FLASH_ACR_LATENCY) | FLASH_ACR_LATENCY_2;

  //Setup PLL to multiply HSE of 16Mhz to 72Mhz --------------------
  // clear the PLL configuration bits
  RCC->CFGR &= ~(RCC_CFGR_PLLSRC | RCC_CFGR_PLLXTPRE | RCC_CFGR_PLLMULL);
  
  // set the PLL to use the external oscillator, and multiply by a factor of 9 (8mhz * 9 = 72)
  RCC->CFGR |= RCC_CFGR_PLLSRC_HSE | RCC_CFGR_PLLXTPRE_HSE_Div2 | RCC_CFGR_PLLMULL9;
  
  // set the divider for the main system clock (72 / 1 = 72)
  RCC->CFGR |= RCC_CFGR_HPRE_DIV1;
  
  // set the divider for the APB2 bus (72 / 1 = 72)
  RCC->CFGR |= RCC_CFGR_PPRE2_DIV1;
  
  // set the divider for the APB1 bus (72 / 2 = 36)
  RCC->CFGR |= RCC_CFGR_PPRE1_DIV2;

  //--------------------

  // turn on the PLL
  RCC->CR |= RCC_CR_PLLON;
  
  // wait till the PLL is ready (check for timeout here)
  while((RCC->CR & RCC_CR_PLLRDY) == 0) {}
  
  // make the PLL the system clock
  RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_PLL;
  
  // wait for the PLL to become active
  while((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL) {};
    
  RCC_SYSCLKConfig(RCC_SYSCLKSource_HSI);
    
  // Enable USART1, GPIOA, GPIOD and AFIO clocks
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOA |
                         RCC_APB2Periph_GPIOB | RCC_APB2Periph_GPIOC | 
                         RCC_APB2Periph_GPIOD | RCC_APB2Periph_AFIO | RCC_APB2Periph_SPI1 |
                         RCC_APB2Periph_ADC1, ENABLE);
			 
  // Enable USB clock
  RCC_USBCLKConfig(RCC_USBCLKSource_PLLCLK_1Div5);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USB, ENABLE);
			
  // Enable USART2 clock
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
			 
  // Enable USART3 clock
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);  
}

static void RTC_Configuration(void)
{
  /* Enable PWR and BKP clocks */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR | RCC_APB1Periph_BKP, ENABLE);

  /* Allow access to BKP Domain */
  PWR_BackupAccessCmd(ENABLE);

  /* Reset Backup Domain */
  //BKP_DeInit();

